src/test/resources/com/zuora/opg/test/json/stripe_2/creditcard/cancel/case_01/payment_cancel_response.json

{
  "id":"pi_3MyVz7SHKlqiaBI9021dV2fZ",
  "object":"payment_intent",
  "amount":1000,
  "amount_capturable":0,
  "amount_details":{
    "tip":{

    }
  },
  "amount_received":0,
  "application":"ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM",
  "application_fee_amount":null,
  "automatic_payment_methods":null,
  "canceled_at":1681891582,
  "cancellation_reason":null,
  "capture_method":"manual",
  "charges":{
    "object":"list",
    "data":[

    ],
    "has_more":false,
    "total_count":0,
    "url":"/v1/charges?payment_intent=pi_3MyVz7SHKlqiaBI9021dV2fZ"
  },
  "client_secret":"pi_3MyVz7SHKlqiaBI9021dV2fZ_secret_DcZw0HiQnJFxKTGXfXyweHBeO",
  "confirmation_method":"automatic",
  "created":1681891405,
  "currency":"inr",
  "customer":null,
  "description":null,
  "invoice":null,
  "last_payment_error":null,
  "latest_charge":null,
  "level3":null,
  "livemode":false,
  "metadata":{

  },
  "next_action":null,
  "on_behalf_of":null,
  "payment_method":"pm_1MyVz7SHKlqiaBI9hlPsYbQa",
  "payment_method_options":{
    "card":{
      "installments":null,
      "mandate_options":null,
      "network":null,
      "request_three_d_secure":"automatic"
    }
  },
  "payment_method_types":[
    "card"
  ],
  "processing":null,
  "receipt_email":null,
  "review":null,
  "setup_future_usage":null,
  "shipping":null,
  "source":null,
  "statement_descriptor":null,
  "statement_descriptor_suffix":null,
  "status":"canceled",
  "transfer_data":null,
  "transfer_group":null
}